_org/2023-06-26-june-papers.org
#+OPTIONS: ^:nil
#+BEGIN_EXPORT html
---
layout: default
title: Paper Digest of June 2023
tags: [UB-Tree, B+-Tree, Z-Curve]
nav_order: {{ page.date }}
---
#+END_EXPORT
|-----------------------------------------------------------------+----------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------+----------|
| Title                                                           | Authors              | Synthesis                                                                                                                                                                                   | Publisher | Keywords |
|-----------------------------------------------------------------+----------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------+----------|
| Generalized Multi-dimensional Data Mapping and Query Processing | Rui Zhang, et al.    | This paper propose a framework GiMP can be customized to different data mapping schemas, for example, the UB-Tree, the Pyramid technique, the iMinMax and the iDistance.                    | TODS 2005 |          |
| Integrating the UB-Tree into a Database System Kernel           | Frank Ramsak, et al. | The paper presents the experience of intergrating the UB-Tree into a database system. 1. The UB-Tree is just like the B-Tree except the key is calculated from multidimentional attributes using methods like the Z-Order. 2. Page splitting is also a little different. It is better to split the page near the middle point. So that the performance is better on average. | VLDB 2000 |          |
|-----------------------------------------------------------------+----------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------+----------|
