_posts/2023-06-26-june-papers.md
---
layout: default
title: Paper Digest of June 2023
tags: [UB-Tree, B+-Tree, Z-Curve]
nav_order: {{ page.date }}
---

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Authors</th>
<th scope="col" class="org-left">Synthesis</th>
<th scope="col" class="org-left">Publisher</th>
<th scope="col" class="org-left">Keywords</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Generalized Multi-dimensional Data Mapping and Query Processing</td>
<td class="org-left">Rui Zhang, et al.</td>
<td class="org-left">This paper propose a framework GiMP can be customized to different data mapping schemas, for example, the UB-Tree, the Pyramid technique, the iMinMax and the iDistance.</td>
<td class="org-left">TODS 2005</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">Integrating the UB-Tree into a Database System Kernel</td>
<td class="org-left">Frank Ramsak, et al.</td>
<td class="org-left">The paper presents the experience of intergrating the UB-Tree into a database system. 1. The UB-Tree is just like the B-Tree except the key is calculated from multidimentional attributes using methods like the Z-Order. 2. Page splitting is also a little different. It is better to split the page near the middle point. So that the performance is better on average.</td>
<td class="org-left">VLDB 2000</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

